export enum DescriptionForHistory {
    UPD_TRADE="Изменение по числу бумаг в обеспечении после исполнения обязательства",
    ADD_OBLIGATION_STATUS = "Добавление статуса исполнения обязательства",
    ADD_TRADE ="Создание сделки",

    //================================================================
    ACCEPT_TRADE = "Сделка подтверждена контрагентом contrName.",
    ACCEPT_TRADE_AND_IS_ACTIVE = "Сделка подтверждена контрагентом contrName. Обновление статуса сделки на «Активна».",
    ADD_SIGN_TO_CONTRACT = "Добавление для сделки ЭЦП контрагента contrName. Создание обязательства по 1-ой части РЕПО.",
    CLOSE_CONTRACT = "Закрытие сделки. Определение обязательства по 2-ой части REPO. Обновление статуса сделки на «Закрыта».",
    ADD_PRICE_TO_CONTRACT = "Добавление цены переоценки данной бумаги в данной сделке в обеспечении. Выполнена переоценка, определение обязательств и начисление процентов.",
    CREATE_OBLIGATION = "Создание обязательства для debitorOrCreditor"
}
